Repository: phuongnam195/simplane-client-admin
Catalog: lib/l10n/intl_*.arb
Languages: vi

# languageCode
source: en
vi: vi

# language
source: English
vi: Tiếng Việt

# error_no_internet
source: Cannot connect to server, please check your connection and try again!
vi: Không thể kết nối với máy chủ, vui lòng kiểm tra kết nối của bạn và thử lại!

# error_timeout
source: Connection timeout. Please try again!
vi: Hết thời gian kết nối. Vui lòng thử lại!

source: Error
vi: Lỗi

source: No data
vi: Không có dữ liệu

# unknown_error
source: Unknown error, please try again!
vi: Lỗi không xác định, vui lòng thử lại!

source: Register
vi: Đăng ký

source: Sign in
vi: Đăng nhập

source: Full name
vi: Họ và tên

source: Username
vi: Tên đăng nhập

source: Password
vi: Mật khẩu

source: Retype password
vi: Nhập lại mật khẩu

# not_empty
source: Cannot be empty!
vi: Không được để trống!

# retype_password_not_match
source: Retype password does not match!
vi: Mật khẩu nhập lại không khớp!

source: Flight code
vi: Mã chuyến bay

# from_airport
source: From
vi: Từ

# to_airport
source: To
vi: Đến

# flight_datetime
source: Date/time
vi: Ngày/giờ

# flight_duration
source: Duration
vi: Thời gian bay

# class_seat_count
source: {ticketClass}'s seat
vi: Số vé {ticketClass}

# flight_search_hint
source: Flight code, airport,...
vi: Mã chuyến bay, sân bay,...

# pick_duration
source: Pick a duration
vi: Chọn khoảng thời gian

# flight_title
source: Flight {flightCode}
vi: Chuyến bay {flightCode}

source: Intermediate airport
vi: Sân bay trung gian

source: Stop duration
vi: Thời gian dừng

source: Ticket code
vi: Mã vé

source: Flight date
vi: Ngày bay

source: Passenger
vi: Hành khách

source: Identity number
vi: Số CCCD

source: Phone number
vi: Số điện thoại

source: Ticket class
vi: Hạng vé

source: Price
vi: Giá

# booked_time
source: Time of booking
vi: Thời gian đặt vé

# approved_time
source: Time of approving
vi: Thời gian phê duyệt

source: Flight schedule
vi: Lịch trình chuyến bay

source: Ticket
vi: Vé

source: Report
vi: Báo cáo

source: Logout
vi: Đăng xuất

source: All
vi: Tất cả

source: Returnable
vi: Có thể hoàn

source: Departed
vi: Đã khởi hành

source: Not departed
vi: Chưa khởi hành

source: Month
vi: Tháng

# flight_count
source: Number of flights
vi: Số lượng chuyến bay

# ticket_count
source: Number of tickets
vi: Số lượng vé

source: Revenue
vi: Doanh thu

source: Annual Revenue Report
vi: Báo cáo doanh thu hằng năm

source: Booking
vi: Đặt vé

# booking_title
source: Booking for flight {flightCode}
vi: Đặt vé cho chuyến bay {flightCode}

# avail_ticket_count
source: {count} tickets left
vi: còn {count} vé

source: Pick ticket class:
vi: Chọn hạng vé:

# passenger_info
source: Passenger's info
vi: Thông tin hành khách

source: First name
vi: Họ và tên đêm

source: Last name
vi: Tên

source: Email address
vi: Địa chỉ email

source: Confirm
vi: Xác nhận

source: New flight
vi: Thêm chuyến bay mới

source: Departure airport
vi: Sân bay đi

source: Arrival airport
vi: Sân bay đến

# ticket_class_info
source: {name} class's information
vi: Thông tin hạng vé {name}

source: Seat amount
vi: Số ghế

source: Add flight successfully!
vi: Thêm chuyến bay thành công!

source: Staff
vi: Nhân viên

source: Delete staff
vi: Xóa nhân viên

# delete_staff_confirm
source: Are you sure to delete this staff?
vi: Bạn có chắc chắn xóa nhân viên này không?

source: Cancel
vi: Hủy

source: Delete
vi: Xóa

# booking_successfully
source: Successfully booking!
vi: Đặt vé thành công!

source: Delete flight
vi: Xóa chuyến bay

# delete_flight_confirm
source: Are you sure to delete this flight?
vi: Bạn có chắc chắn xóa chuyến bay này không?

source: Airport
vi: Sân bay

source: Code
vi: Mã

source: Name
vi: Tên

source: Address
vi: Địa chỉ

# airport_info_update
source: Airport information update
vi: Cập nhật thông tin sân bay

source: Update
vi: Cập nhật

source: Update airport successfully!
vi: Cập nhật sân bay thành công!

# add_airport_successfully
source: Add new airport successfully!
vi: Thêm sân bay thành công!

source: Delete airport successfully!
vi: Xóa sân bay thành công!

source: Add airport
vi: Thêm sân bay

source: Return ticket
vi: Hoàn vé

# ticket_return_overdued
source: Sorry! Ticket return overdued.
vi: Xin lỗi! Vé này đã quá hạn hoàn lại.

# ticket_return_not_suitable
source: Sorry! This ticket class is not returnable!
vi: Xin lỗi! Hạng vé này không thể hoàn lại.

# ticket_return_confirm
source: The return fee is {fee}. Do you want to proceed with the return?
vi: Phí hoàn vé là {fee}. Bạn có muốn tiếp tục không?

source: Agree
vi: Đồng ý

# ticket_returned_successfully
source: The ticket is returned successfully!
vi: Vé đã được hoàn thành công!

# flight_duration_least
source: Flight duration must be at least {minDuration} minutes!
vi: Thời lượng chuyến bay phải ít nhất là {minDuration} phút!

# stop_duration_condition
source: At intermediate airport, stop duration must belong to [{min}, {max}]!
vi: Tại sân bay trung gian, thời gian dừng phải thuộc khoảng [{min}, {max}] phút!

# min_flight_duration
source: Minimum flight duration
vi: Thời lượng bay tối thiểu

# max_middle_airport
source: Maximum number of intermediate airports
vi: Số lượng sân bay trung gian tối đa

source: Minimum
vi: Tối thiểu

source: Maximum
vi: Tối đa

# latest_time_booking
source: Latest time when booking (before departure)
vi: Thời gian chậm nhất khi đặt vé

# latest_time_cancel_booking
source: Latest time when returning (before departure)
vi: Thời gian chậm nhất khi hủy đặt vé

source: Rule
vi: Quy định

source: Rule updated successfully!
vi: Đã cập nhật quy định thành công!
